modules/OpenQBMM/tutorials/denseAGFoam/verticalChannel-a01-p4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     denseAGFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  7;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       2e-04;


functions1
{

      channelTurbCalcs1
	  {
	    type        channelTurbCalcs;
	    libs        (libchannelTurbCalcs);
	    enabled true;
        timeStart   1.5;
	    timeEnd         200;
      	    outputControl   outputTime;
	    //	    outputInterval   1;
	    //        outputControl   timeStep;
	    //        outputInterval  200;
		Nx    			56;
	    Ny	  			200;
		Nz   			40;
        FaceX           57( 0.0
							0.0002
							0.0004759459
							0.0008566767
							0.001381982
							0.002106762
							0.003106762
							0.004101909
							0.005097056
							0.006092203
							0.007087351
							0.008082498
							0.009077645
							0.01007279
							0.01106794
							0.01206309
							0.01305823
							0.01405338
							0.01504853
							0.01604368
							0.01703882
							0.01803397
							0.01902912
							0.02002426
							0.02101941
							0.02201456
							0.02300971
							0.02400485
							0.025
							0.02599515
							0.02699029
							0.02798544
							0.02898059
							0.02997574
							0.03097088
							0.03196603
							0.03296118
							0.03395632
							0.03495147
							0.03594662
							0.03694177
							0.03793691
							0.03893206
							0.03992721
							0.04092235
							0.0419175
							0.04291265
							0.0439078
							0.04490294
							0.04589809
							0.04689324
							0.04789324
							0.04861802
							0.04914332
							0.04952405
							0.0498
							0.05
							);
	  }
}



// ************************************************************************* //
